# Size Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSet..::..Size Property
AssetSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Size { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get ();
}
```

# See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace